#pragma warning(disable : 4996) // отключение ошибки c4996
#include <stdio.h> // необходимо для коррктного вызова
				   // функций ввода\вывода
int main(void)	   // главная функция main не принимает
				   // данных от операционной системы,
				   // возвращает статус завершения
{                  // начало тела программы
	// описание переменных
	float V;    // объём бассейна
	float U1;   // скорость вытекания
	float U2;   // скорость поступания
	float t;    // искомое время опустошения бассейна
	// ввод исходных данных
	printf("V =");       // вывод на экран подсказки: V =
		scanf("%f", &V); // ввод с клавиатуры значение переменной V
	printf("U1 =");      // вывод на экран подсказки U1 =
		scanf("%f", &U1);// ввод с клавиатуры значение переменной U1
	printf("U2 =");      // вывод на экран подсказки U2 =
		scanf("%f", &U2);// ввод с клавиатуры значение переменной U2
	// решение задачи
	t = V / (U1 - U2);   // вычисление искомого времени опустошшения
	// вывод результатов
	printf("time = %f\n", t); // вывод на экран
							  // значений переменной t
	// программа возвращается 
	// признак корректного завершения
	return 0;
}	// конец тела программы
